namespace lab4;

public class Task1
{
    public static void Execute()
    {
        string[] surnames =
        [
            "Алексеев", "Ахмедеев", "Бондин", "Вольнов", "Гергерт", "Гончаров", "Жакина", "Зданникова", "Зимин",
            "Кабулов", "Клексин", "Коньков", "Лазарев", "Назарова", "Наурзбаева", "Поварнин", "Решетов", "Сарсембаев",
            "Тастемиров", "Тимошин", "Томский", "Трукан", "Фельдт", "Чернявский", "Чугунов", "Шмидт"
        ];
        string[] names =
        [
            "Никита", "Самир", "Данил", "Кирилл", "Анна", "Пётр", "Динара", "Алина", "Андрей", "Артём", "Роман",
            "Максим", "Матвей", "Анастасия", "Альбина", "Юрий", "Артём", "Георгий", "Рустам", "Андрей", "Михаил",
            "Егор", "Андрей", "Никита", "Данил", "Антон"
        ];
        string[] combined = new string[surnames.Length + names.Length];

        for (int i = 0, j = 0; i < combined.Length; i += 2, j++)
        {
            combined[i] = names[j];
            if (i + 1 < combined.Length)
            {
                combined[i + 1] = surnames[j];
            }
        }

        Console.WriteLine("Объединенный массив:");
        for (int i = 0; i < combined.Length; i++)
        {
            Console.WriteLine($"Индекс {i}: {combined[i]}");
        }
    }
}