namespace lab5;

public class Task1
{
    public void Execute()
    {
        string[] students =
        {
            "Алексеев Никита",
            "Ахмедеев Самир",
            "Бондин Данил",
            "Вольнов Кирилл",
            "Гергерт Анна",
            "Гончаров Пётр",
            "Жакина Динара",
            "Зданникова Алина",
            "Зимин Андрей",
            "Кабулов Артём",
            "Клексин Роман",
            "Коньков Максим",
            "Лазарев Матвей",
            "Назарова Анастасия",
            "Наурзбаева Альбина",
            "Поварнин Юрий",
            "Решетов Артём",
            "Сарсембаев Георгий",
            "Тастемиров Рустам",
            "Тимошин Андрей",
            "Томский Михаил",
            "Трукан Егор",
            "Фельдт Андрей",
            "Чернявский Никита",
            "Чугунов Данил",
            "Шмидт Антон"
        };

        string file = "ИВТ-244.txt";
        string backup = "ИВТ-244_backup.txt";

        File.WriteAllLines(file, students);
        File.Copy(file, backup, overwrite: true);
        File.Delete(file);
    }
}